#include "Scene.h"

// 负责初始化起始环境中的天体
void InitCelestialBodies(std::vector<Object>& objs) {
    objs = {
       // 参数：位置，速度，质量，密度，颜色，是否发光
       //超新星
       Object(glm::vec3(0, 0, 0), glm::vec3(0, 0, 0), 1.989 * pow(10, 25), 2014, glm::vec4(1.0f, 0.929f, 0.176f, 1.0f), true),
       //行星红
       Object(glm::vec3(-3000, 650, 0), glm::vec3(0, 0, 500), 5.97219*pow(10, 23), 5515, glm::vec4(1.0f, 0.25f, 0.56f, 1.0f)),
       //蓝
       Object(glm::vec3(5000, 650, 0), glm::vec3(0, 0, -500), 5.97219*pow(10, 23), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),
       Object(glm::vec3(5250, 650, 0), glm::vec3(0, 0, -50), 5.97219*pow(10, 21), 5515, glm::vec4(1.0f, 1.0f, 1.0f, 1.0f)),
       //绿
       Object(glm::vec3(0, 500, 9000), glm::vec3(-500, -50, 0), 5.97219*pow(10, 23.5), 5515, glm::vec4(0.0f, 0.5f, 0.15f, 1.0f)),
       Object(glm::vec3(0, 550, 9500), glm::vec3(0, 0, -100), 5.97219*pow(10, 21), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),
       Object(glm::vec3(0, 450, 8500), glm::vec3(0, 0, -100), 5.97219*pow(10, 21), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),
       //浅蓝
       Object(glm::vec3(0, 500, -10500), glm::vec3(-300, 50, 0), 5.97219*pow(10, 23.5), 5515, glm::vec4(0.35f, 0.85f, 0.99f, 1.0f)),
       Object(glm::vec3(350, 450, -10500), glm::vec3(0, 0, -550), 5.97219*pow(10, 21), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),
       Object(glm::vec3(-350, 450, -10500), glm::vec3(0, 0, 550), 5.97219*pow(10, 21), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),
       Object(glm::vec3(0, 450, -11050), glm::vec3(0, -550, 0), 5.97219*pow(10, 21), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),
    
       Object(glm::vec3(5000, 450, 8000), glm::vec3(0, 0, -500), 5.97219*pow(10, 23), 5515, glm::vec4(0.30f, 0.25f, 0.10f, 0.5f)),
       Object(glm::vec3(5250, 450, 8000), glm::vec3(0, 0, -50), 5.97219*pow(10, 21), 5515, glm::vec4(1.0f, 1.0f, 1.0f, 1.0f)),

       Object(glm::vec3(-6000, 500, -9000), glm::vec3(500, 50, 0), 5.97219*pow(10, 23.5), 5515, glm::vec4(0.8f, 0.2f, 0.15f, 1.0f)),
       Object(glm::vec3(-6000, 550, -9500), glm::vec3(0, 0, -100), 5.97219*pow(10, 21), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),
       Object(glm::vec3(-6000, 450, -8500), glm::vec3(0, 0, -100), 5.97219*pow(10, 21), 5515, glm::vec4(0.0f, 1.0f, 1.0f, 1.0f)),

       Object(glm::vec3(-3000, 650, 4000), glm::vec3(0, 0, 500), 5.97219*pow(10, 23), 5515, glm::vec4(0.60f, 0.25f, 0.90f, 1.0f)),

       Object(glm::vec3(6000, 650, -9000), glm::vec3(0, 0, -500), 5.97219*pow(10, 23), 5515, glm::vec4(0.4f, 0.3f, 0.2f, 1.0f)),
 
    };
}